Revit 2027 API
BuiltInFailures.CopyPasteFailures.CannotCopySketchGrid Property
 Work Planes cannot be copied.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCopySketchGrid { get; }
Public Shared ReadOnly Property CannotCopySketchGrid As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCopySketchGrid {
	FailureDefinitionId^ get ();
}
static member CannotCopySketchGrid : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace